---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotExplodeElement
source: html/b9f70cfe-0c26-f422-679b-e3166fc29b67.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotExplodeElement Property

Can't explode the imported object.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotExplodeElement { get; }
```